examples/rendered/v0.2/scenario_flow_diagram_type/flow_journey_topology_challenge_example/compact_detail/flow_journey_topology_challenge.scenario_flow.dot
digraph scenario_flow {
  rankdir=TB;
  graph [fontname="Public Sans", nodesep=0.7, ranksep=0.9];
  node [fontname="Public Sans"];
  edge [fontname="Public Sans"];
  subgraph rank_step {
    rank=same;
    "lane_step" [shape=plaintext, label="Steps"];
    "S-010" [shape="box", style="rounded", label="Select a Node"];
    "S-020" [shape="box", style="rounded", label="Review Diagrams Containing Current Node"];
    "S-040" [shape="box", style="rounded", label="Add Relationship"];
    "S-041" [shape="box", style="rounded", label="Add relationship, by node"];
    "S-042" [shape="box", style="rounded", label="Add outgoing relationship"];
    "S-043" [shape="box", style="rounded", label="Add incoming relationship"];
    "S-021" [shape="box", style="rounded", label="Select Diagram"];
    "S-022" [shape="box", style="rounded", label="View Node in New Diagram Context"];
    "S-030" [shape="box", style="rounded", label="Select Diagram Content"];
    "S-031" [shape="box", style="rounded", label="Adjust View"];
    "S-032" [shape="box", style="rounded", label="Name the New View"];
  }
  "lane_step" -> "S-010" [style=invis, weight=100];
  "S-020" -> "S-040" [style=invis, weight=100];
  "S-041" -> "S-042" [style=invis, weight=100];
  "S-042" -> "S-043" [style=invis, weight=100];
  "S-043" -> "S-021" [style=invis, weight=100];
  "S-022" -> "S-030" [style=invis, weight=100];
  "S-010" -> "S-020" [weight=4];
  "S-010" -> "S-040" [weight=4];
  "S-020" -> "S-021" [weight=4];
  "S-021" -> "S-022" [weight=4];
  "S-030" -> "S-031" [weight=4];
  "S-031" -> "S-032" [weight=4];
  "S-040" -> "S-041" [weight=4];
  "S-040" -> "S-042" [weight=4];
  "S-040" -> "S-043" [weight=4];
}
